; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_2 object type_1 type_3)
 (:predicates (pred_3 ?v3 - type_1 ?v8 - type_2)
 	      (pred_2 ?v6 - object ?v8 - type_2)
	      (pred_4 ?v3 - type_1 ?v7 - type_3)
	      (pred_1 ?v3 - type_1 ?v6 - object ?v7 - type_3))

   (:action op_2
       :parameters  (?v3 - type_1 ?v5 ?v2 - type_2)
       :precondition (and  (pred_3 ?v3 ?v5))
       :effect (and  (pred_3 ?v3 ?v2)
		     (not (pred_3 ?v3 ?v5))))

   (:action op_1
       :parameters (?v3 - type_1 ?v4 - object ?v1 - type_2 ?v7 - type_3)
       :precondition  (and  (pred_2 ?v4 ?v1) (pred_3 ?v3 ?v1) (pred_4 ?v3 ?v7))
       :effect (and (pred_1 ?v3 ?v4 ?v7)
		    (not (pred_2 ?v4 ?v1)) 
		    (not (pred_4 ?v3 ?v7))))

   (:action op_3
       :parameters (?v3 - type_1 ?v4 - object ?v1 - type_2 ?v7 - type_3)
       :precondition  (and  (pred_1 ?v3 ?v4 ?v7) (pred_3 ?v3 ?v1))
       :effect (and (pred_2 ?v4 ?v1)
		    (pred_4 ?v3 ?v7)
		    (not (pred_1 ?v3 ?v4 ?v7)))))

; problem
(define (problem gripper-2-4-4)
(:domain gripper-strips)
(:objects obj_03 obj_13 - type_1
obj_02 obj_07 obj_14 obj_10 - type_3
obj_04 obj_05 obj_09 obj_11 - type_2
obj_08 obj_01 obj_06 obj_12 - object)
(:init
(pred_3 obj_03 obj_05)
(pred_4 obj_03 obj_02)
(pred_4 obj_03 obj_07)
(pred_3 obj_13 obj_09)
(pred_4 obj_13 obj_14)
(pred_4 obj_13 obj_10)
(pred_2 obj_08 obj_05)
(pred_2 obj_01 obj_05)
(pred_2 obj_06 obj_09)
(pred_2 obj_12 obj_11)
)
(:goal
(and
(pred_2 obj_08 obj_05)
(pred_2 obj_01 obj_05)
(pred_2 obj_06 obj_05)
(pred_2 obj_12 obj_11)
)
)

(:constraints
  (and
    (always (not (and (pred_3 obj_03 obj_05) (pred_3 obj_13 obj_05))))
  )
)
)

; plan
1. (op_1 obj_13 obj_06 obj_09 obj_10)
   deleted: (pred_2 obj_06 obj_09) (pred_4 obj_13 obj_10)
   added: (pred_1 obj_13 obj_06 obj_10)
   goals met: 3 of 4
2. (op_2 obj_03 obj_05 obj_04)
   deleted: (pred_3 obj_03 obj_05)
   added: (pred_3 obj_03 obj_04)
   goals met: 3 of 4
3. (op_2 obj_13 obj_09 obj_05)
   deleted: (pred_3 obj_13 obj_09)
   added: (pred_3 obj_13 obj_05)
   goals met: 3 of 4
4. (op_3 obj_13 obj_06 obj_05 obj_10)
   deleted: (pred_1 obj_13 obj_06 obj_10)
   added: (pred_2 obj_06 obj_05) (pred_4 obj_13 obj_10)
   goals met: 4 of 4
